brew "fzf"
vscode "aaron-bond.better-comments"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "cschlosser.doxdocgen"
vscode "d-biehl.robotcode"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "eliean.vscode-svn"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "fantasytyx.tortoise-svn"
vscode "felipecaputo.git-project-manager"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "hookyqr.beautify"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "numso.prettier-standard-vscode"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "quandinh.onehalf-dark"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "robocorp.robotframework-lsp"
vscode "ryu1kn.partial-diff"
vscode "shardulm94.trailing-spaces"
vscode "sketchbuch.vsc-workspace-sidebar"
vscode "slaier.matlab-complete"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "xabikos.javascriptsnippets"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
npm "node-gyp"
