tap "borgbackup/tap"
tap "gromgit/fuse"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core"
tap "iina/mpv-iina"
tap "mvp/uhubctl", "https://github.com/mvp/uhubctl"
tap "rhettbull/osxphotos"
brew "xz"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "apr-util"
brew "autoconf"
brew "python@3.10"
brew "autojump"
brew "automake"
brew "bib-tool"
brew "boost"
brew "glib"
brew "carthage"
brew "libmpc"
brew "gcc"
brew "openblas"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "pkgconf"
brew "hdf5"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "create-dmg"
brew "ctags"
brew "diffutils"
brew "docutils"
brew "e2fsprogs"
brew "exiftool"
brew "ffmpeg"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg@4"
brew "findutils"
brew "flex"
brew "fzf"
brew "gawk"
brew "gcc@11"
brew "gh"
brew "git"
brew "gnu-getopt"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "grep"
brew "grpc"
brew "libtool"
brew "guile"
brew "libimobiledevice"
brew "libzip"
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "iperf3"
brew "libssh2"
brew "lsusb"
brew "make"
brew "mas"
brew "ncurses"
brew "netcat"
brew "netcdf"
brew "nghttp2"
brew "nmap"
brew "node"
brew "numpy"
brew "ocrmypdf"
brew "vtk"
brew "opencv"
brew "openjdk"
brew "pandoc"
brew "platformio"
brew "qt@5"
brew "pyqt@5"
brew "python-tabulate"
brew "python@3.11"
brew "python@3.12"
brew "qt"
brew "quilt"
brew "safe-rm"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "sphinx-doc"
brew "subversion"
brew "tcl-tk"
brew "telnet"
brew "thefuck"
brew "tree"
brew "uhubctl", args: ["HEAD"]
brew "virtualenv"
brew "wakeonlan"
brew "wget"
brew "wimlib"
brew "yt-dlp"
brew "zlib", link: true
brew "borgbackup/tap/borgbackup-fuse"
brew "gromgit/fuse/ntfs-3g-mac"
brew "rhettbull/osxphotos/osxphotos"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "balenaetcher"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "keycastr"
cask "knockknock"
cask "latest"
cask "lm-studio"
cask "lunar"
cask "macfuse"
cask "openinterminal"
cask "oversight"
cask "reikey"
cask "tabby"
cask "taskexplorer"
cask "temurin"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "vorta"
cask "whatsapp@beta"
mas "AdGuard for Safari", id: 1440147259
mas "App Language Chooser", id: 451732904
mas "APTV", id: 1630403500
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Blackmagic RAW Speed Test", id: 1466185689
mas "CARROTweather", id: 993487541
mas "Developer", id: 640199958
mas "Exporter", id: 1099120373
mas "Flighty", id: 1358823008
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "IsItPrivate", id: 1440322906
mas "Jamjams", id: 6477182037
mas "Jump Desktop", id: 524141863
mas "junkworld", id: 6448185316
mas "Keynote", id: 361285480
mas "Kindle Classic", id: 405399194
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Maipo", id: 789066512
mas "MediaInfo", id: 510620098
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "MQTT Explorer", id: 1455214828
mas "Numbers", id: 361304891
mas "OneDrive", id: 823766827
mas "OpenSpeedTest-Server", id: 1579499874
mas "Pages", id: 361309726
mas "Pocket", id: 568494494
mas "Quiver", id: 866773894
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "Steam Link", id: 1246969117
mas "Tampermonkey Classic", id: 1482490089
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
mas "高德地图", id: 461703208
vscode "aaron-bond.better-comments"
vscode "alexisvt.flutter-snippets"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "cschlosser.doxdocgen"
vscode "d-biehl.robotcode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eliean.vscode-svn"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "fantasytyx.tortoise-svn"
vscode "felipecaputo.git-project-manager"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "hookyqr.beautify"
vscode "iamhyc.overleaf-workshop"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "keesschollaart.vscode-home-assistant"
vscode "kiteco.kite"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "numso.prettier-standard-vscode"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pdconsec.vscode-print"
vscode "pkief.material-icon-theme"
vscode "quandinh.onehalf-dark"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "robocorp.robotframework-lsp"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.partial-diff"
vscode "shardulm94.trailing-spaces"
vscode "sj0000e.hexdiff"
vscode "sketchbuch.vsc-workspace-sidebar"
vscode "slaier.matlab-complete"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unclebeast.har-viewer"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "xabikos.javascriptsnippets"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
