tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
cask "osxfuse"
brew "autoconf"
brew "automake"
brew "python", link: false
brew "ctags"
brew "e2fsprogs"
brew "ext4fuse"
brew "ffmpeg"
brew "flex"
brew "gdb"
brew "git"
brew "gnupg"
brew "iperf3"
brew "libtool"
brew "mas"
brew "netcat"
brew "nmap"
brew "opencv"
brew "pdnsd"
brew "platformio"
brew "python@2"
brew "shellcheck"
brew "shfmt"
brew "subversion"
brew "telnet"
brew "thefuck"
brew "valgrind", args: ["HEAD"]
brew "wget"
brew "wine"
brew "youtube-dl"
brew "zlib", link: true
cask "android-platform-tools"
cask "cheatsheet"
cask "chromedriver"
cask "font-hack-nerd-font"
cask "iterm2"
cask "keycastr"
mas "1Password", id: 443987910
mas "AdBlock", id: 1402042596
mas "CARROT Weather", id: 993487541
mas "Deliveries", id: 924726344
mas "Disk Speed Test", id: 425264550
mas "Helium", id: 1054607607
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Maipo", id: 789066512
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 736189492
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
