tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
cask "osxfuse"
brew "autoconf"
brew "automake"
brew "ctags"
brew "e2fsprogs"
brew "ext4fuse"
brew "ffmpeg"
brew "flex"
brew "gdb"
brew "git"
brew "gnupg"
brew "libtool"
brew "iperf3"
brew "mas"
brew "netcat"
brew "nmap"
brew "opencv"
brew "pdnsd"
brew "platformio"
brew "python@2", link: false
brew "shellcheck"
brew "shfmt"
brew "subversion"
brew "telnet"
brew "thefuck"
brew "valgrind", args: ["HEAD"]
brew "wget"
brew "wine"
brew "youtube-dl"
brew "zlib", link: true
cask "android-platform-tools"
cask "cheatsheet"
cask "chromedriver"
cask "font-hack-nerd-font"
cask "iterm2"
cask "keycastr"
